<?php
    $所有字段 = array(
        "ID",
        "姓名",
        "结算时间",
        "人员类别",
        "医疗总费用",
        "中医适宜技术费用占比",
        "病种",
        "主要手术操作",
        "相关手术操作",
        "病种组编码",
        "病种组分值",
        "病种组费用",
        "病历大夫"
    );
    $全部字段 = array(
        "ID",
        "姓名",
        "结算时间",
        "人员类别",
        "医疗总费用",
        "中医适宜技术费用占比",
        "病种",
        "主要手术操作",
        "相关手术操作",
        "病种组编码",
        "病种组分值",
        "病种组费用",
        "病历大夫",
        "结算时间起点",
        "结算时间止点",
        "医疗总费用下限",
        "医疗总费用上限",
        "中医适宜技术费用占比下限",
        "中医适宜技术费用占比上限",
        "病种组分值下限",
        "病种组分值上限",
        "病种组费用下限",
        "病种组费用上限"
    );
    
    if ($_SERVER["REQUEST_METHOD"] === "POST"){
        $全局["结果"]["请求参数"] = array();
        foreach ($全部字段 as $当前字段){
            if (isset($_POST[$当前字段])){
                $全局["结果"]["请求参数"][$当前字段] = $_POST[$当前字段];
            }
            else {
                // $全局["结果"]["请求参数"][$当前字段] = null;
            }
        }
    }
    else {
        $全局["结果"]["建议"] = "只接受POST请求";
    }
?>