<?php
    require_once "../main.php";
    require_once "../user/权限.php";
    require_once "./main.php";
    
    if (!查询权限($资源名="患者统计", $权限名="新增")){
        $全局["结果"]["建议"] = "没有权限";
        exit();
    }
    
    if (!isset($全局["结果"]["请求参数"]["ID"])){
        $全局["结果"]["建议"] = "必须指定ID";
        exit();
    }
    
    $修改指令 = "update 患者 set ";
    foreach ($所有字段 as $当前字段){
        if (isset($全局["结果"]["请求参数"][$当前字段])){
            $修改指令 .= $当前字段 . "='" . $全局["结果"]["请求参数"][$当前字段] . "', ";
        }
        else {
            $修改指令 .= $当前字段 . "=null, ";
        }
    }
    
    $修改指令 = substr($修改指令, 0, -2) . " where ID=" . $全局["结果"]["请求参数"]["ID"];
    $修改 = mysqli_query($全局["数据库连接"], $修改指令);
    if (!$修改){
        $全局["结果"]["建议"] = "数据保存失败";
        exit();
    }
?>