<?php
    require_once "../main.php";
    require_once "../user/权限.php";
    require_once "./main.php";
    
    if (!查询权限($资源名="患者统计", $权限名="新增")){
        $全局["结果"]["建议"] = "没有权限";
        exit();
    }
    
    $新增指令1 = "";
    $新增指令2 = "";
    foreach ($所有字段 as $当前字段){
        if (isset($全局["结果"]["请求参数"][$当前字段])){
            $新增指令1 .= $当前字段 . ", ";
            $新增指令2 .= "'" . $全局["结果"]["请求参数"][$当前字段] . "', ";
        }
        else {
            continue;
        }
    }
    
    $新增指令 = "insert into 患者 (" . substr($新增指令1, 0, -2) . ") values (" . substr($新增指令2, 0, -2) . ")";
    //$新增 = mysqli_query($全局["数据库连接"], $新增指令);
    if (!$新增){
        $全局["结果"]["建议"] = "数据保存失败";
        exit();
    }
?>