<?php
    require_once "../main.php";
    require_once "../user/权限.php";
    require_once "./main.php";
    
    if (!查询权限($资源名="患者统计", $权限名="查询")){
        $全局["结果"]["建议"] = "没有权限";
        exit();
    }
    
    $查询患者指令 = "select * from 患者 where ";
    foreach ($全部字段 as $当前字段){
        if (isset($全局["结果"]["请求参数"][$当前字段])){
            if ($当前字段 === "结算时间起点"){
                $查询患者指令 .= "结算时间>='" . $全局["结果"]["请求参数"][$当前字段] . "' and ";
            }
            elseif ($当前字段 === "结算时间止点"){
                $查询患者指令 .= "结算时间<='" . $全局["结果"]["请求参数"][$当前字段] . "' and ";
            }
            elseif ($当前字段 === "医疗总费用下限"){
                $查询患者指令 .= "医疗总费用>=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "医疗总费用上限"){
                $查询患者指令 .= "医疗总费用<=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "中医适宜技术费用占比下限"){
                $查询患者指令 .= "中医适宜技术费用占比>=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "中医适宜技术费用占比上限"){
                $查询患者指令 .= "中医适宜技术费用占比<=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "病种组分值下限"){
                $查询患者指令 .= "病种组分值>=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "病种组分值上限"){
                $查询患者指令 .= "病种组分值<=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "病种组费用下限"){
                $查询患者指令 .= "病种组费用>=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            elseif ($当前字段 === "病种组费用上限"){
                $查询患者指令 .= "病种组费用<=" . $全局["结果"]["请求参数"][$当前字段] . " and ";
            }
            else {
                $查询患者指令 .= $当前字段 . "='" . $全局["结果"]["请求参数"][$当前字段] . "' and ";
            }
        }
        else {
            // continue;
        }
    }
    
    if (substr($查询患者指令, -5) === " and "){
        $查询患者指令 = substr($查询患者指令,0 , -5);
    }
    else {
        $查询患者指令 = substr($查询患者指令,0 , -7);
    }
    
    $查询患者指令 .= " order by 结算时间 desc";
    $查询患者 = mysqli_query($全局["数据库连接"], $查询患者指令);
    $全局["结果"]["查询结果"] = mysqli_fetch_all($查询患者, MYSQLI_ASSOC);
?>